In [37]:
import pandas as pd
import numpy as np

In [39]:
dataf = pd.read_csv('student_dataset.csv')

In [41]:
dataf.head()

,Student_Names,Phone_No.,Math,Physics,Chemistry,Grade,Comment,Roll No.,School Name,Student Address
0,Donald Contreras,9208625450,76,84,54,B+,Good Pursuance,524613,Martin Luther School,"478 Mooney Park, New Valerie, VI 28836"
1,Joseph Horton,9886408555,91,75,78,A,Very Good Achivement,561635,Martin Luther School,"037 Matthew Shores, Greeneton, CA 98399"
2,Savannah Burns MD,9047592659,64,98,20,C,Below Average Achivement,560985,Martin Luther School,"96124 Lloyd Streets, Edwardmouth, DC 61677"
3,William Carter,9048473864,15,95,32,D,Poor Pursuance,535126,Martin Luther School,"11959 Clark Village, Ivanview, NH 43940"
4,John Rodriguez,9685225730,86,86,66,B+,Good Pursuance,559410,Martin Luther School,"051 Weaver Glen Apt. 724, West Davidborough, M..."

In [43]:
# Artificially introduce missing values (for demonstration purposes)
dataf.loc[0:3, 'Math'] = np.nan  # Introduce missing values in the 'Math' column
dataf.loc[5:8, 'Physics'] = np.nan  # Introduce missing values in the 'Physics' column
print("artificially added some null values if there arent any in dataset for demonstration")

artificially added some null values if there arent any in dataset for demonstration

In [47]:
dataf.isnull()

,Student_Names,Phone_No.,Math,Physics,Chemistry,Grade,Comment,Roll No.,School Name,Student Address
0,False,False,True,False,False,False,False,False,False,False
1,False,False,True,False,False,False,False,False,False,False
2,False,False,True,False,False,False,False,False,False,False
3,False,False,True,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
8995,False,False,False,False,False,False,False,False,False,False
8996,False,False,False,False,False,False,False,False,False,False
8997,False,False,False,False,False,False,False,False,False,False
8998,False,False,False,False,False,False,False,False,False,False
8999,False,False,False,False,False,False,False,False,False,False

In [45]:
# Check for missing values
print(dataf.isnull().sum())

Student_Names      0
Phone_No.          0
Math               4
Physics            4
Chemistry          0
Grade              0
Comment            0
Roll No.           0
School Name        0
Student Address    0
dtype: int64

In [49]:
# 1. Handle missing values
dataf.fillna(dataf.mean(numeric_only=True), inplace=True)
print("Missing values handled (if any).\n")

Missing values handled (if any).

In [51]:
# Verify that missing values have been handled
print("After handling missing values:\n", dataf.isnull().sum())

After handling missing values:
 Student_Names      0
Phone_No.          0
Math               0
Physics            0
Chemistry          0
Grade              0
Comment            0
Roll No.           0
School Name        0
Student Address    0
dtype: int64

In [53]:
numeric_cols = dataf.select_dtypes(include='number')
Q1 = numeric_cols.quantile(0.25)
Q3 = numeric_cols.quantile(0.75)
IQR = Q3 - Q1
dataf = dataf[(numeric_cols >= Q1 - 1.5 * IQR) & (numeric_cols <= Q3 + 1.5 * IQR)].dropna()
print("Outliers removed (if any).\n")

Outliers removed (if any).

In [55]:
# 3. Transform one variable (log transform on 'Math')
dataf['Math'] = np.log1p(dataf['Math'])
print("Log transformation applied to 'Math' column.\n")

Log transformation applied to 'Math' column.

In [57]:
# Show final summary
print("Final Data Summary:\n")
print(dataf.describe())

Final Data Summary:

       Phone_No.  Math  Physics  Chemistry  Roll No.
count        0.0   0.0      0.0        0.0       0.0
mean         NaN   NaN      NaN        NaN       NaN
std          NaN   NaN      NaN        NaN       NaN
min          NaN   NaN      NaN        NaN       NaN
25%          NaN   NaN      NaN        NaN       NaN
50%          NaN   NaN      NaN        NaN       NaN
75%          NaN   NaN      NaN        NaN       NaN
max          NaN   NaN      NaN        NaN       NaN